module Config

/// Коды дисциплин, которые должны быть исключены из анализа.
let exclusions =
    // Общеуниверситетские дисциплины СВ.5162
    ["057495"; "057596"; "058037"; "058039"; "058041"; "059998"; "060000"; "060008"; "060009"; "060010"; "060059"; 
        "062762"; "700000"; "800000"; "900000"]
    // РПП СВ.5162, у них совсем другой формат
    @ ["064764"; "064792"; "064793"; "064795"; "064797"]
    // Общеуниверситетские дисциплины СВ.5006
    @ ["000900"; "000999"; "001000"; "001196"; "002181"; "036751"; "037056"; "038689"; "057495"; "057596"; "058037"; 
        "058039"; "058041"; "058262"; "059998"; "060008"; "060009"; "060010"; "060059"]
    // РПП СВ.5006
    @ ["058604"; "058605"; "058606"; "002193" ]

/// Гуглотаблицы с информацией о том, кому принадлежат дисциплины. Формат:
/// "код учебного плана", ("id гуглотаблицы", "имя вкладки").
/// См., например, https://docs.google.com/spreadsheets/d/1aP3biZf9vVMLG26Ra3acreMW2iZLCoXz93WPqK2ZV-U
/// В принципе, любая таблица, где в первом столбце будет код дисциплины в квадратных скобках, 
/// а во втором --- Фамилия И.О. --- подойдёт.
let owners =
    [ "5162-2020", ("1aP3biZf9vVMLG26Ra3acreMW2iZLCoXz93WPqK2ZV-U", "2020")
      "5006-2019", ("1TsOCZltVSHxQouOTU8WDyW4oxITs1xUyV_GC-TfqbfI", "2019")
      "5006-2018", ("1TsOCZltVSHxQouOTU8WDyW4oxITs1xUyV_GC-TfqbfI", "2018")
      "5006-2017", ("1TsOCZltVSHxQouOTU8WDyW4oxITs1xUyV_GC-TfqbfI", "2017")
      "5665-2019", ("1IJ00e7c3-Yybb-pgZfLNlOMWggS1aKlJ43KjUBYWRns", "2019")
      "5665-2020", ("1IJ00e7c3-Yybb-pgZfLNlOMWggS1aKlJ43KjUBYWRns", "2020") ]