module Config

/// Коды дисциплин, которые должны быть исключены из анализа.
let exclusions = []
(*
    // Общеуниверситетские дисциплины СВ.5162
    [ "057495"; "057596"; "058037"; "058039"; "058041"; "059998"; "060000"; "060008"; "060009"; "060010"; "060059"; 
      "062762"; "700000"; "800000"; "900000" ]
    // РПП СВ.5162, у них совсем другой формат
    @ [ "064764"; "064792"; "064793"; "064795"; "064797" ]
    // Общеуниверситетские дисциплины СВ.5006
    @ [ "000900"; "000999"; "001000"; "001196"; "002181"; "036751"; "037056"; "038689"; "057495"; "057596"; "058037"; 
        "058038"; "058039"; "058041"; "058262"; "059998"; "060008"; "060009"; "060010"; "060059"; "500000"; "500001" ]
    // РПП СВ.5006
    @ [ "058604"; "058605"; "058606"; "002193" ]
    // Общеуниверситетские дисциплины ВМ.5665
    @ [ "027272"; "058039"; "058059"; "060000"; "060011"; "060016"; "060018"; "060019"; "060139"; "060579"; "060139";
        "060140"; "060579"; "062765" ]
    // РПП ВМ.5665-2020
    @ [ "064847"; "064848"; "064849"; "064850"; "064851"; ]
    // РПП ВМ.5665-2019
    @ [ "027200"; "027201"; "058505"; "058506"; "058515" ]
*)

/// Гуглотаблицы с информацией о том, кому принадлежат дисциплины. Формат:
/// "код учебного плана", ("id гуглотаблицы", "имя вкладки").
/// См., например, https://docs.google.com/spreadsheets/d/1aP3biZf9vVMLG26Ra3acreMW2iZLCoXz93WPqK2ZV-U
/// В принципе, любая таблица, где в первом столбце будет код дисциплины в квадратных скобках, 
/// а во втором --- Фамилия И.О. --- подойдёт.
let owners =
    [ "5162-2020", ("1aP3biZf9vVMLG26Ra3acreMW2iZLCoXz93WPqK2ZV-U", "2020")
      "5162-2022", ("1aP3biZf9vVMLG26Ra3acreMW2iZLCoXz93WPqK2ZV-U", "2022")
      "5006-2019", ("1TsOCZltVSHxQouOTU8WDyW4oxITs1xUyV_GC-TfqbfI", "2019")
      "5006-2018", ("1TsOCZltVSHxQouOTU8WDyW4oxITs1xUyV_GC-TfqbfI", "2018")
      "5006-2017", ("1TsOCZltVSHxQouOTU8WDyW4oxITs1xUyV_GC-TfqbfI", "2017")
      "5665-2019", ("1IJ00e7c3-Yybb-pgZfLNlOMWggS1aKlJ43KjUBYWRns", "2019")
      "5665-2020", ("1IJ00e7c3-Yybb-pgZfLNlOMWggS1aKlJ43KjUBYWRns", "2020") 
      "5665-2021", ("1IJ00e7c3-Yybb-pgZfLNlOMWggS1aKlJ43KjUBYWRns", "2020") ]

/// Множество строк, которые не должны встречаться в РПД. Например, коды компетенций "чужих" планов.
let forbiddenStrings = [ "ОКБ-"; "ПК-"; "профиль" ]
